# Main Panel 
SERVER_IP = IP &#3586;&#3629;&#3591;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;
BROADCASTING_IP = &#3585;&#3634;&#3619;&#3585;&#3619;&#3632;&#3592;&#3634;&#3618; &#3652;&#3629;&#3614;&#3637;
START = &#3648;&#3619;&#3636;&#3656;&#3617;
STOP = &#3627;&#3618;&#3640;&#3604;
APA_DIR   =&#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637;&#3586;&#3629;&#3591; Apache&#3595;&#3629;&#3615;&#3649;&#3623;&#3619;&#3660;  
BROWSE    = &#3648;&#3619;&#3637;&#3618;&#3585;&#3604;&#3641;

WELCOME_MSG = &#3618;&#3636;&#3609;&#3604;&#3637;&#3605;&#3657;&#3629;&#3609;&#3619;&#3633;&#3610;&#3626;&#3641;&#3656; SMILE!
LANG_CHANGE_NOTICE = &#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3649;&#3611;&#3621;&#3591; &#3616;&#3634;&#3625;&#3634;&#3649;&#3621;&#3657;&#3623;
HELP_FIRST =&#3618;&#3636;&#3609;&#3604;&#3637;&#3605;&#3657;&#3629;&#3609;&#3619;&#3633;&#3610;&#3626;&#3641;&#3656; SMILE.&#3585;&#3656;&#3629;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3648;&#3619;&#3636;&#3656;&#3617;&#3585;&#3636;&#3592;&#3585;&#3619;&#3619;&#3617;, &#3626;&#3635;&#3619;&#3623;&#3592;&#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3588;&#3656;&#3634;&#3585;&#3634;&#3619;&#3605;&#3619;&#3623;&#3592;&#3626;&#3629;&#3610;&#3607;&#3637;&#3656;&#3617;&#3637;&#3585;&#3634;&#3619;&#3585;&#3635;&#3627;&#3609;&#3604;&#3588;&#3656;&#3634;&#3607;&#3637;&#3656;&#3648;&#3627;&#3617;&#3634;&#3632;&#3626;&#3617;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3626;&#3616;&#3634;&#3614;&#3649;&#3623;&#3604;&#3621;&#3657;&#3629;&#3617;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603; \n &#3585;&#3656;&#3629;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3585;&#3636;&#3592;&#3585;&#3619;&#3619;&#3617; &#3585;&#3619;&#3640;&#3603;&#3634;&#3585;&#3604;&#3611;&#3640;&#3656;&#3617; &#8220;&#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;&#8221; &#3651;&#3609;  &#3649;&#3612;&#3591; &#8220;&#3585;&#3619;&#3632;&#3649;&#3626;&#3585;&#3636;&#3592;&#3585;&#3619;&#3619;&#3617;&#8221;
SETTING = &#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3588;&#3656;&#3634; 
SMILE_TITLE = &#3605;&#3633;&#3623;&#3588;&#3623;&#3610;&#3588;&#3640;&#3617; SMILE
HELP_MSG_TITLE = &#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3629;&#3609;&#3640;&#3648;&#3588;&#3619;&#3634;&#3632;&#3627;&#3660;

WARN = &#3588;&#3635;&#3648;&#3605;&#3639;&#3629;&#3609;
WARN_NOTICE = &#3652;&#3615;&#3621;&#3660;&#3629;&#3639;&#3656;&#3609; &#3654; &#3607;&#3637;&#3656;&#3617;&#3637;&#3629;&#3618;&#3641;&#3656;&#3651;&#3609;&#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637;&#3607;&#3637;&#3656;&#3648;&#3621;&#3639;&#3629;&#3585;. &#3588;&#3640;&#3603;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3607;&#3637;&#3656;&#3592;&#3632;&#3648;&#3586;&#3637;&#3618;&#3609;&#3607;&#3633;&#3610;&#3617;&#3633;&#3657;&#3618;?

Q_SAVE = &#3588;&#3640;&#3603;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3607;&#3637;&#3656;&#3592;&#3632;&#3610;&#3633;&#3609;&#3607;&#3638;&#3585;&#3588;&#3635;&#3606;&#3634;&#3617;&#3648;&#3614;&#3639;&#3656;&#3629;&#3651;&#3594;&#3657;&#3651;&#3609;&#3629;&#3609;&#3634;&#3588;&#3605;&#3617;&#3633;&#3657;&#3618;?
SQ_TITLE = &#3610;&#3633;&#3609;&#3607;&#3638;&#3585;&#3588;&#3635;&#3606;&#3634;&#3617;

# display top score
H_SCORE = &#3588;&#3632;&#3649;&#3609;&#3609;&#3626;&#3641;&#3591;&#3626;&#3640;&#3604;
TOP_SCORER = &#3612;&#3641;&#3657;&#3607;&#3637;&#3656;&#3652;&#3604;&#3657;&#3588;&#3632;&#3649;&#3609;&#3609;&#3626;&#3641;&#3591;&#3626;&#3640;&#3604;
H_RATE  = &#3629;&#3633;&#3609;&#3604;&#3633;&#3610;&#3607;&#3637;&#3656;&#3626;&#3641;&#3591;&#3607;&#3637;&#3656;&#3626;&#3640;&#3604;
Q_OWNER = &#3588;&#3635;&#3606;&#3634;&#3617;&#3607;&#3637;&#3656;&#3626;&#3619;&#3657;&#3634;&#3591;&#3586;&#3638;&#3657;&#3609;&#3650;&#3604;&#3618;

USED_Q_NOTICE = &#3651;&#3594;&#3657;&#3588;&#3635;&#3606;&#3634;&#3617;&#3607;&#3637;&#3656;&#3648;&#3605;&#3619;&#3637;&#3618;&#3617;
Q_DIR = &#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637;&#3588;&#3635;&#3606;&#3634;&#3617;
SEL_LANG = &#3648;&#3621;&#3639;&#3629;&#3585;&#3651;&#3594;&#3657;&#3616;&#3634;&#3625;&#3634;&#3648;&#3611;&#3657;&#3634;&#3627;&#3617;&#3634;&#3618;

# flow part
ACTIVITY_FLOW = &#3585;&#3619;&#3632;&#3649;&#3626;&#3585;&#3636;&#3592;&#3585;&#3619;&#3619;&#3617; 
CONNECT = &#3648;&#3594;&#3639;&#3656;&#3629;&#3617;&#3605;&#3656;&#3629;
START_MK_Q = &#3648;&#3619;&#3636;&#3656;&#3617;&#3651;&#3627;&#3657;&#3588;&#3635;&#3606;&#3634;&#3617;
START_MK_Q_SKIP = &#3605;&#3633;&#3657;&#3591;&#3588;&#3635;&#3606;&#3634;&#3617; (&#3586;&#3657;&#3634;&#3617;)
START_SV_Q = &#3648;&#3619;&#3636;&#3656;&#3617;&#3649;&#3585;&#3657;&#3611;&#3633;&#3597;&#3627;&#3634;
SR = &#3649;&#3626;&#3604;&#3591;&#3612;&#3621;

#Student Status
SS_TITLE = &#3626;&#3606;&#3634;&#3609;&#3616;&#3634;&#3614;&#3586;&#3629;&#3591;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;
STUDENT = &#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;
QUESTION = &#3588;&#3635;&#3606;&#3634;&#3617;
ANSWER = &#3588;&#3635;&#3605;&#3629;&#3610;
TOTAL = &#3612;&#3621;&#3619;&#3623;&#3617;
SCORE_BOARD = &#3585;&#3619;&#3632;&#3604;&#3634;&#3609;&#3588;&#3632;&#3649;&#3609;&#3609;

#question status
Q_STAT = &#3626;&#3606;&#3634;&#3609;&#3616;&#3634;&#3614; &#3586;&#3629;&#3591;&#3588;&#3635;&#3606;&#3634;&#3617;
Q = &#3588;&#3635;&#3606;&#3634;&#3617;
Q_NOT_AVAILABLE = &#3588;&#3635;&#3606;&#3634;&#3617;&#3607;&#3637;&#3656;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657;&#3652;&#3604;&#3657;

#student status
SCORE_TITLE = &#3585;&#3619;&#3632;&#3604;&#3634;&#3609;&#3588;&#3632;&#3649;&#3609;&#3609; &#3586;&#3629;&#3591;
SCORE = &#3588;&#3632;&#3649;&#3609;&#3609;
Q_NUM = &#3592;&#3635;&#3609;&#3623;&#3609;&#3588;&#3635;&#3606;&#3634;&#3617;
C_ANSWER = &#3588;&#3635;&#3605;&#3629;&#3610;&#3607;&#3637;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;
CH_ANSWER = &#3588;&#3635;&#3605;&#3629;&#3610;&#3607;&#3637;&#3656;&#3648;&#3621;&#3639;&#3629;&#3585;
G_RATE = &#3585;&#3634;&#3619;&#3592;&#3633;&#3604;&#3629;&#3633;&#3609;&#3604;&#3633;&#3610;
S_NOT_AVAILABLE = &#3585;&#3619;&#3632;&#3604;&#3634;&#3609;&#3588;&#3632;&#3649;&#3609;&#3609;&#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657;&#3652;&#3604;&#3657;.

Q_N = &#3588;&#3635;&#3605;&#3629;&#3610; &#3652;&#3617;&#3656;.
C_N_PPL = &#3592;&#3635;&#3609;&#3623;&#3609;&#3588;&#3609;&#3607;&#3637;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;
AVG_RATE = &#3588;&#3632;&#3649;&#3609;&#3609;&#3648;&#3593;&#3621;&#3637;&#3656;&#3618;

T_RESULT = &#3612;&#3621;&#3619;&#3623;&#3617;
S_NAME = &#3594;&#3639;&#3656;&#3629;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;
C_NUM = &#3649;&#3585;&#3657;&#3652;&#3586; 
Q_RATE = &#3588;&#3632;&#3649;&#3609;&#3609;&#3588;&#3635;&#3606;&#3634;&#3617;
NO_AVAILABLE = &#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3652;&#3604;&#3657;
WINNER = &#3612;&#3641;&#3657;&#3594;&#3609;&#3632;

STAT = &#3626;&#3606;&#3634;&#3609;&#3616;&#3634;&#3614;
NUM = &#3592;&#3635;&#3609;&#3623;&#3609;
OWNER = &#3648;&#3592;&#3657;&#3634;&#3586;&#3629;&#3591;
CORRECT = &#3649;&#3585;&#3657;&#3652;&#3586;%
RATE = &#3585;&#3634;&#3619;&#3592;&#3633;&#3604;&#3629;&#3633;&#3609;&#3604;&#3633;&#3610;

RETAKE_QUIZ = &#3626;&#3629;&#3610;&#3595;&#3656;&#3629;&#3617;&#3649;&#3610;&#3610;&#3607;&#3604;&#3626;&#3629;&#3610;
START_NEW_SESSION = &#3648;&#3619;&#3636;&#3656;&#3617;&#3648;&#3595;&#3626;&#3594;&#3633;&#3656;&#3609;&#3651;&#3627;&#3617;&#3656;

#notice strings
ERROR_APACH_TOP = Apache&#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637; &#3652;&#3617;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;. &#3585;&#3619;&#3640;&#3603;&#3634;&#3648;&#3619;&#3637;&#3618;&#3585;&#3604;&#3641; Apache &#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637; &#3607;&#3637;&#3656; &#3651;&#3609;&#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3588;&#3656;&#3634;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603;

ERROR_CREATE_JUNTION_TOP = &#3652;&#3617;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3626;&#3619;&#3657;&#3634;&#3591;&#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637; &#3585;&#3634;&#3619;&#3604;&#3635;&#3648;&#3609;&#3636;&#3609; &#3585;&#3619;&#3640;&#3603;&#3634;&#3648;&#3619;&#3637;&#3618;&#3585;&#3604;&#3641;&#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637;&#3610;&#3609; &#3607;&#3637;&#3656;&#3606;&#3641;&#3585;&#3605;&#3657;&#3629;&#3591;&#3586;&#3629;&#3591; apache &#3651;&#3609;&#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3588;&#3656;&#3634;&#3648;&#3595;&#3636;&#3619;&#3660;&#3615;&#3648;&#3623;&#3629;&#3619;&#3660;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603;

ERROR_BROWSE_PREV = &#3652;&#3604;&#3648;&#3619;&#3585;&#3607;&#3629;&#3619;&#3637;&#3592;&#3632;&#3606;&#3641;&#3585;&#3648;&#3621;&#3639;&#3629;&#3585;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3588;&#3635;&#3606;&#3634;&#3617;&#3585;&#3656;&#3629;&#3609;&#3627;&#3609;&#3657;&#3634;&#3609;&#3637;&#3657;&#3652;&#3617;&#3656;&#3626;&#3617;&#3610;&#3641;&#3619;&#3603;&#3660;. &#3585;&#3619;&#3640;&#3603;&#3634;&#3648;&#3619;&#3637;&#3618;&#3585;&#3604;&#3641;&#3651;&#3627;&#3617;&#3656;

WAIT_NOTICE = &#3619;&#3629;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3648;&#3586;&#3657;&#3634;&#3619;&#3656;&#3623;&#3617;.
MK_Q_NOTICE = &#3619;&#3629;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3605;&#3633;&#3657;&#3591;&#3588;&#3635;&#3606;&#3634;&#3617;.
SV_Q_WARNING = &#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3617;&#3634;&#3585;&#3585;&#3623;&#3656;&#3634;&#3627;&#3609;&#3638;&#3656;&#3591;&#3588;&#3635;&#3606;&#3634;&#3617;.
SV_Q_NOTICE = &#3619;&#3629;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3651;&#3609;&#3585;&#3634;&#3619;&#3649;&#3585;&#3657;&#3611;&#3633;&#3597;&#3627;&#3634;&#3588;&#3635;&#3606;&#3634;&#3617;.
RETAKE_QUIZ_NOTICE = &#3588;&#3635;&#3606;&#3634;&#3617;&#3626;&#3629;&#3610;&#3595;&#3656;&#3629;&#3617;.  &#3619;&#3629;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3649;&#3585;&#3657;&#3611;&#3633;&#3597;&#3627;&#3634;&#3588;&#3635;&#3606;&#3634;&#3617;
SR_NOTICE = &#3612;&#3621;&#3585;&#3634;&#3619;&#3607;&#3604;&#3626;&#3629;&#3610;&#3592;&#3632;&#3606;&#3641;&#3585;&#3626;&#3656;&#3591;&#3652;&#3611;&#3607;&#3637;&#3656;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3649;&#3605;&#3656;&#3621;&#3632;&#3588;&#3609;.
TOOLTIP_CHECKTIME = &#3585;&#3619;&#3632;&#3610;&#3623;&#3609;&#3585;&#3634;&#3619;&#3592;&#3635;&#3585;&#3633;&#3604; &#3648;&#3623;&#3621;&#3634;&#3652;&#3617;&#3656;&#3626;&#3609;&#3633;&#3610;&#3626;&#3609;&#3640;&#3609;&#3651;&#3609;&#3619;&#3640;&#3656;&#3609;&#3609;&#3637;&#3657;.
NETWORK_WARNING = This computer is not connected to any network. Please close the SMILE application and connect this computer to a network first.
	
	